## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 9 to add, 8 to change, 9 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                         NAME                         |
|----------|------------------------------------------------------|
| add      | `aws_s3_object.audit_logs_code`                      |
|          | `aws_s3_object.form_archiver_code`                   |
|          | `aws_s3_object.nagware_code`                         |
|          | `aws_s3_object.reliability_code`                     |
|          | `aws_s3_object.reliability_dlq_consumer_code`        |
|          | `aws_s3_object.response_archiver_code`               |
|          | `aws_s3_object.submission_code`                      |
|          | `aws_s3_object.vault_integrity_code`                 |
| delete   | `aws_s3_bucket_object.audit_logs_code`               |
|          | `aws_s3_bucket_object.form_archiver_code`            |
|          | `aws_s3_bucket_object.nagware_code`                  |
|          | `aws_s3_bucket_object.reliability_code`              |
|          | `aws_s3_bucket_object.reliability_dlq_consumer_code` |
|          | `aws_s3_bucket_object.response_archiver_code`        |
|          | `aws_s3_bucket_object.submission_code`               |
|          | `aws_s3_bucket_object.vault_integrity_code`          |
| update   | `aws_lambda_function.audit_logs`                     |
|          | `aws_lambda_function.form_archiver`                  |
|          | `aws_lambda_function.nagware`                        |
|          | `aws_lambda_function.reliability`                    |
|          | `aws_lambda_function.reliability_dlq_consumer`       |
|          | `aws_lambda_function.response_archiver`              |
|          | `aws_lambda_function.submission`                     |
|          | `aws_lambda_function.vault_integrity`                |
| recreate | `aws_signer_signing_job.vault_integrity[0]`          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.audit_logs will be updated in-place
  ~ resource "aws_lambda_function" "audit_logs" {
        id                             = "Audit_Logs"
      ~ last_modified                  = "2023-12-08T15:00:33.000+0000" -> (known after apply)
      ~ s3_object_version              = "iMfvFxLKoRigCnZVFaJuLTUsn_6RFOu5" -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.form_archiver will be updated in-place
  ~ resource "aws_lambda_function" "form_archiver" {
        id                             = "Archive_Form_Templates"
      ~ last_modified                  = "2023-12-08T15:00:33.000+0000" -> (known after apply)
      ~ s3_object_version              = "j94rcpwyFRwAA7JXRDCDafL85O6hDx2J" -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.nagware will be updated in-place
  ~ resource "aws_lambda_function" "nagware" {
        id                             = "Nagware"
      ~ last_modified                  = "2023-12-14T16:47:42.000+0000" -> (known after apply)
      ~ s3_object_version              = "TvJ2N1_.VVw5oGteCmT4AbDx3ioM1jrD" -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ last_modified                  = "2023-12-13T19:30:42.000+0000" -> (known after apply)
      ~ s3_object_version              = "4Om4TGyikL91F7nkKFedil3uV.tyzsU6" -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability_dlq_consumer will be updated in-place
  ~ resource "aws_lambda_function" "reliability_dlq_consumer" {
        id                             = "Reliability_DLQ_Consumer"
      ~ last_modified                  = "2023-12-08T15:00:33.000+0000" -> (known after apply)
      ~ s3_object_version              = "cRf.Dj.LTDhuOUv.k5w6JGkAehmjZ9Ji" -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.response_archiver will be updated in-place
  ~ resource "aws_lambda_function" "response_archiver" {
        id                             = "Response_Archiver"
      ~ last_modified                  = "2023-12-08T15:00:34.000+0000" -> (known after apply)
      ~ s3_object_version              = "FlkRJWeQrrZC4lwjiEbKG4vPnw__MBWu" -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.submission will be updated in-place
  ~ resource "aws_lambda_function" "submission" {
        id                             = "Submission"
      ~ last_modified                  = "2023-12-08T15:00:34.000+0000" -> (known after apply)
      ~ s3_object_version              = "klyLdBblY5xlz0rQhwFtMCYOIZaIxbHS" -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.vault_integrity will be updated in-place
  ~ resource "aws_lambda_function" "vault_integrity" {
        id                             = "Vault_Data_Integrity_Check"
      ~ last_modified                  = "2023-12-14T16:47:42.000+0000" -> (known after apply)
      ~ s3_bucket                      = "forms-staging-lambda-code" -> (known after apply)
      ~ s3_key                         = "signed/5fb02f2a-e7d7-43c0-bb98-aeaf9f2a6f24" -> (known after apply)
      ~ source_code_hash               = "9opCvMNrZA+BCLvHUGkHDweCXfVwLgP5jcHfkTPLySc=" -> "TowbMcppnki+0a5fq50Oral3CqleiwGw7U1igvFz0Ws="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_object.audit_logs_code will be destroyed
  # (because aws_s3_bucket_object.audit_logs_code is not in configuration)
  - resource "aws_s3_bucket_object" "audit_logs_code" {
      - acl                    = "private" -> null
      - bucket                 = "forms-staging-lambda-code" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "5449eb3d251eb9da4bed4cc4d9dbaefb" -> null
      - force_destroy          = false -> null
      - id                     = "audit_logs_code" -> null
      - key                    = "audit_logs_code" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/tmp/audit_logs_code.zip" -> null
      - source_hash            = "Buwqu7thcIBHaO7og80TTG/nf0wASM21hynA9WhHPz0=" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "iMfvFxLKoRigCnZVFaJuLTUsn_6RFOu5" -> null
    }

  # aws_s3_bucket_object.form_archiver_code will be destroyed
  # (because aws_s3_bucket_object.form_archiver_code is not in configuration)
  - resource "aws_s3_bucket_object" "form_archiver_code" {
      - acl                    = "private" -> null
      - bucket                 = "forms-staging-lambda-code" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "32a053b83abef39244ef777907685f12" -> null
      - force_destroy          = false -> null
      - id                     = "form_archiver_code" -> null
      - key                    = "form_archiver_code" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/tmp/form_archiver_code.zip" -> null
      - source_hash            = "Az0liG599yfRg7cqDAtpcwSYHtgtsQI2m7K2x/krsxY=" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "j94rcpwyFRwAA7JXRDCDafL85O6hDx2J" -> null
    }

  # aws_s3_bucket_object.nagware_code will be destroyed
  # (because aws_s3_bucket_object.nagware_code is not in configuration)
  - resource "aws_s3_bucket_object" "nagware_code" {
      - acl                    = "private" -> null
      - bucket                 = "forms-staging-lambda-code" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "0720e067d02d67a7316c76293828208e-2" -> null
      - force_destroy          = false -> null
      - id                     = "nagware_code" -> null
      - key                    = "nagware_code" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/tmp/nagware_code.zip" -> null
      - source_hash            = "OcLo5We0JHv2naLzzmmeTs5+2hTEVT1bAlfB7LuxJFs=" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "TvJ2N1_.VVw5oGteCmT4AbDx3ioM1jrD" -> null
    }

  # aws_s3_bucket_object.reliability_code will be destroyed
  # (because aws_s3_bucket_object.reliability_code is not in configuration)
  - resource "aws_s3_bucket_object" "reliability_code" {
      - acl                    = "private" -> null
      - bucket                 = "forms-staging-lambda-code" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "6eee2a95108e6849a4d8d54f7de2cce4-2" -> null
      - force_destroy          = false -> null
      - id                     = "reliability_code" -> null
      - key                    = "reliability_code" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/tmp/reliability_code.zip" -> null
      - source_hash            = "nf3YFotstkw84Smj5lGE5Dft0jWhLgYZGsp2crPVU6Q=" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "4Om4TGyikL91F7nkKFedil3uV.tyzsU6" -> null
    }

  # aws_s3_bucket_object.reliability_dlq_consumer_code will be destroyed
  # (because aws_s3_bucket_object.reliability_dlq_consumer_code is not in configuration)
  - resource "aws_s3_bucket_object" "reliability_dlq_consumer_code" {
      - acl                    = "private" -> null
      - bucket                 = "forms-staging-lambda-code" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "4505a631fc6a071f64f549b91eaf725a" -> null
      - force_destroy          = false -> null
      - id                     = "reliability_dlq_consumer_code" -> null
      - key                    = "reliability_dlq_consumer_code" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/tmp/reliability_dlq_consumer_code.zip" -> null
      - source_hash            = "F7WbeUnrxxXYZkj7tkJyJcFV6inBl3QWsV9AzLcvfB4=" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "cRf.Dj.LTDhuOUv.k5w6JGkAehmjZ9Ji" -> null
    }

  # aws_s3_bucket_object.response_archiver_code will be destroyed
  # (because aws_s3_bucket_object.response_archiver_code is not in configuration)
  - resource "aws_s3_bucket_object" "response_archiver_code" {
      - acl                    = "private" -> null
      - bucket                 = "forms-staging-lambda-code" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "f10c294a1ed067cf983e8c9cd497d37e-2" -> null
      - force_destroy          = false -> null
      - id                     = "response_archiver_code" -> null
      - key                    = "response_archiver_code" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/tmp/response_archiver_code.zip" -> null
      - source_hash            = "HlOcaGXKLFMSZO3DF101vb5Af5YWWPGBw6Z16Zu9hVI=" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "FlkRJWeQrrZC4lwjiEbKG4vPnw__MBWu" -> null
    }

  # aws_s3_bucket_object.submission_code will be destroyed
  # (because aws_s3_bucket_object.submission_code is not in configuration)
  - resource "aws_s3_bucket_object" "submission_code" {
      - acl                    = "private" -> null
      - bucket                 = "forms-staging-lambda-code" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "6f15df036a513bfaca7fcea4d4b1fb78-2" -> null
      - force_destroy          = false -> null
      - id                     = "submission_code" -> null
      - key                    = "submission_code" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/tmp/submission_code.zip" -> null
      - source_hash            = "upOHVsX4QZQdq2GJDkBlWCCQTia0Q0WdEVP2ZbhUGXk=" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "klyLdBblY5xlz0rQhwFtMCYOIZaIxbHS" -> null
    }

  # aws_s3_bucket_object.vault_integrity_code will be destroyed
  # (because aws_s3_bucket_object.vault_integrity_code is not in configuration)
  - resource "aws_s3_bucket_object" "vault_integrity_code" {
      - acl                    = "private" -> null
      - bucket                 = "forms-staging-lambda-code" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "71c195eb45edc2203396a57fd03b5884-2" -> null
      - force_destroy          = false -> null
      - id                     = "vault_integrity_code" -> null
      - key                    = "vault_integrity_code" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/tmp/vault_integrity_code.zip" -> null
      - source_hash            = "TowbMcppnki+0a5fq50Oral3CqleiwGw7U1igvFz0Ws=" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "sQTR1bM5TctBB1gnxGI5GNQx3fnc7zbN" -> null
    }

  # aws_s3_object.audit_logs_code will be created
  + resource "aws_s3_object" "audit_logs_code" {
      + acl                    = (known after apply)
      + bucket                 = "forms-staging-lambda-code"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "audit_logs_code"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/tmp/audit_logs_code.zip"
      + source_hash            = "Buwqu7thcIBHaO7og80TTG/nf0wASM21hynA9WhHPz0="
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.form_archiver_code will be created
  + resource "aws_s3_object" "form_archiver_code" {
      + acl                    = (known after apply)
      + bucket                 = "forms-staging-lambda-code"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "form_archiver_code"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/tmp/form_archiver_code.zip"
      + source_hash            = "Az0liG599yfRg7cqDAtpcwSYHtgtsQI2m7K2x/krsxY="
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.nagware_code will be created
  + resource "aws_s3_object" "nagware_code" {
      + acl                    = (known after apply)
      + bucket                 = "forms-staging-lambda-code"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "nagware_code"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/tmp/nagware_code.zip"
      + source_hash            = "OcLo5We0JHv2naLzzmmeTs5+2hTEVT1bAlfB7LuxJFs="
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.reliability_code will be created
  + resource "aws_s3_object" "reliability_code" {
      + acl                    = (known after apply)
      + bucket                 = "forms-staging-lambda-code"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "reliability_code"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/tmp/reliability_code.zip"
      + source_hash            = "nf3YFotstkw84Smj5lGE5Dft0jWhLgYZGsp2crPVU6Q="
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.reliability_dlq_consumer_code will be created
  + resource "aws_s3_object" "reliability_dlq_consumer_code" {
      + acl                    = (known after apply)
      + bucket                 = "forms-staging-lambda-code"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "reliability_dlq_consumer_code"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/tmp/reliability_dlq_consumer_code.zip"
      + source_hash            = "F7WbeUnrxxXYZkj7tkJyJcFV6inBl3QWsV9AzLcvfB4="
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.response_archiver_code will be created
  + resource "aws_s3_object" "response_archiver_code" {
      + acl                    = (known after apply)
      + bucket                 = "forms-staging-lambda-code"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "response_archiver_code"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/tmp/response_archiver_code.zip"
      + source_hash            = "HlOcaGXKLFMSZO3DF101vb5Af5YWWPGBw6Z16Zu9hVI="
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.submission_code will be created
  + resource "aws_s3_object" "submission_code" {
      + acl                    = (known after apply)
      + bucket                 = "forms-staging-lambda-code"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "submission_code"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/tmp/submission_code.zip"
      + source_hash            = "upOHVsX4QZQdq2GJDkBlWCCQTia0Q0WdEVP2ZbhUGXk="
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.vault_integrity_code will be created
  + resource "aws_s3_object" "vault_integrity_code" {
      + acl                    = (known after apply)
      + bucket                 = "forms-staging-lambda-code"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "vault_integrity_code"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/tmp/vault_integrity_code.zip"
      + source_hash            = "TowbMcppnki+0a5fq50Oral3CqleiwGw7U1igvFz0Ws="
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_signer_signing_job.vault_integrity[0] must be replaced
-/+ resource "aws_signer_signing_job" "vault_integrity" {
      ~ completed_at               = "2023-12-07T21:57:02Z" -> (known after apply)
      ~ created_at                 = "2023-12-07T21:57:00Z" -> (known after apply)
      ~ id                         = "5fb02f2a-e7d7-43c0-bb98-aeaf9f2a6f24" -> (known after apply)
      ~ job_id                     = "5fb02f2a-e7d7-43c0-bb98-aeaf9f2a6f24" -> (known after apply)
      ~ job_invoker                = "687401027353" -> (known after apply)
      ~ job_owner                  = "687401027353" -> (known after apply)
      ~ platform_display_name      = "AWS Lambda" -> (known after apply)
      ~ platform_id                = "AWSLambda-SHA384-ECDSA" -> (known after apply)
      ~ profile_version            = "3cak3nO7rT" -> (known after apply)
      ~ requested_by               = "arn:aws:iam::687401027353:user/GitHub_Terraform" -> (known after apply)
      ~ revocation_record          = [] -> (known after apply)
      ~ signature_expires_at       = "2035-03-07T21:57:02Z" -> (known after apply)
      ~ signed_object              = [
          - {
              - s3 = [
                  - {
                      - bucket = "forms-staging-lambda-code"
                      - key    = "signed/5fb02f2a-e7d7-43c0-bb98-aeaf9f2a6f24"
                    },
                ]
            },
        ] -> (known after apply)
      ~ status                     = "Succeeded" -> (known after apply)
      ~ status_reason              = "Signing Succeeded" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ source {
          ~ s3 {
              ~ version = "sQTR1bM5TctBB1gnxGI5GNQx3fnc7zbN" # forces replacement -> (known after apply) # forces replacement
                # (2 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 9 to add, 8 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_2am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_3am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_5am_every_business_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.audit_logs_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.form_archiver_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.nagware_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.reliability_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.reliability_dlq_consumer_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.response_archiver_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.submission_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.vault_integrity_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_signer_signing_profile.lambda_signing_profile[0]"]

40 tests, 19 passed, 21 warnings, 0 failures, 0 exceptions

```

</details>
